In [1]:
import pandas as pd

In [2]:
ls

 Volume in drive C is OS
 Volume Serial Number is A4F3-1F42

 Directory of C:\Users\kavin\Music\ML Course\03-Pandas\my

03/25/2024  07:18 PM    <DIR>          .
03/23/2024  08:49 PM    <DIR>          ..
03/25/2024  07:17 PM    <DIR>          .ipynb_checkpoints
03/21/2024  01:28 PM           678,075 00-Series.ipynb
03/22/2024  05:04 PM           207,937 01-DataFrames.ipynb
03/22/2024  06:08 PM            60,215 02-Conditional-Filtering.ipynb
03/22/2024  11:24 PM           136,756 03-Useful-Methods.ipynb
03/23/2024  10:00 PM            48,800 04-Missing-Data.ipynb
03/25/2024  01:38 AM           225,044 05-Groupby-Operations-and-MultiIndex.ipynb
03/25/2024  02:55 PM            53,439 06-Combining-DataFrames.ipynb
03/25/2024  03:35 PM            10,153 07-Text-Methods.ipynb
03/25/2024  04:47 PM            23,774 08-Time-Methods.ipynb
03/25/2024  07:18 PM               589 09-Inputs-and-Outputs.ipynb
03/25/2024  04:29 PM    <DIR>          data-files
              10 File(s)      1,444,782 bytes
               4 Dir(s)  55,035,072,512 bytes free

In [3]:
pwd

'C:\\Users\\kavin\\Music\\ML Course\\03-Pandas\\my'

In [4]:
df=pd.read_csv("./data-files/example.csv")

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df=pd.read_csv("./data-files/example.csv",index_col=0)

In [7]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [12]:
df=pd.read_csv("./data-files/example.csv",header=None)

In [13]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [14]:
df=pd.read_csv("./data-files/example.csv")

In [17]:
mkdir newfiles

In [24]:
df.to_csv("./newfiles/new_example_file",index=False)

In [25]:
df1=pd.read_csv("./newfiles/new_example_file")

In [26]:
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [28]:
pip install lxml

Requirement already satisfied: lxml in c:\users\kavin\anaconda3\lib\site-packages (4.9.3)
Note: you may need to restart the kernel to use updated packages.

In [29]:
tables=pd.read_html("https://en.wikipedia.org/wiki/World_population")

In [30]:
len(tables)

30

In [34]:
tables[1]

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [57]:
df=tables[11]

In [58]:
df

    Year  Population Yearly growth           Density (pop/km2)
    Year  Population             %    Number Density (pop/km2)
0   1951  2543130380         1.75%  43808223                17
1   1952  2590270899         1.85%  47140519                17
2   1953  2640278797         1.93%  50007898                18
3   1954  2691979339         1.96%  51700542                18
4   1955  2746072141         2.01%  54092802                18
..   ...         ...           ...       ...               ...
68  2019  7764951032         1.06%  81161204                52
69  2020  7840952880         0.98%  76001848                53
70  2021  7909295151         0.87%  68342271                53
71  2022  7975105156         0.83%  65810005                54
72  2023  8045311447         0.88%  70206291                54

[73 rows x 5 columns]

In [59]:
df.columns

MultiIndex([(             'Year',              'Year'),
            (       'Population',        'Population'),
            (    'Yearly growth',                 '%'),
            (    'Yearly growth',            'Number'),
            ('Density (pop/km2)', 'Density (pop/km2)')],
           )

In [65]:
df[("Year","Year")]

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [66]:
df=tables[8]

In [69]:
df

,Rank,Country,Population,Area (km2),Density (pop/km2),Population trend[citation needed]
0,1,India,1389637446,3287263,423,Growing
1,2,Pakistan,242923845,796095,305,Rapidly growing
2,3,Bangladesh,165650475,148460,1116,Growing
3,4,Japan,124214766,377915,329,Declining[104]
4,5,Philippines,114597229,300000,382,Growing
5,6,Vietnam,103808319,331210,313,Growing
6,7,United Kingdom,67791400,243610,278,Growing
7,8,South Korea,51844834,99720,520,Steady
8,9,Taiwan,23580712,35980,655,Steady
9,10,Sri Lanka,23187516,65610,353,Growing

In [70]:
df.to_html("./newfiles/newhtmltable.html",index=False)

In [71]:
pd.read_excel("./data-files/my_excel_file.xlsx")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [74]:
my_excel=pd.ExcelFile("./data-files/my_excel_file.xlsx")

In [75]:
my_excel.sheet_names

['First_Sheet']

In [76]:
df=pd.read_excel("./data-files/my_excel_file.xlsx",sheet_name=None)

In [79]:
df.keys()

dict_keys(['First_Sheet'])

In [81]:
df["First_Sheet"]

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [82]:
df=df["First_Sheet"]

In [83]:
df.to_excel("./newfiles/my_excel.xlsx",index=False)

In [102]:
from sqlalchemy import create_engine
from sqlalchemy.pool import QueuePool

In [103]:
 temp_db =  create_engine('sqlite:///file.db', poolclass=QueuePool)

In [104]:
df=tables[8]

In [105]:
df

,Rank,Country,Population,Area (km2),Density (pop/km2),Population trend[citation needed]
0,1,India,1389637446,3287263,423,Growing
1,2,Pakistan,242923845,796095,305,Rapidly growing
2,3,Bangladesh,165650475,148460,1116,Growing
3,4,Japan,124214766,377915,329,Declining[104]
4,5,Philippines,114597229,300000,382,Growing
5,6,Vietnam,103808319,331210,313,Growing
6,7,United Kingdom,67791400,243610,278,Growing
7,8,South Korea,51844834,99720,520,Steady
8,9,Taiwan,23580712,35980,655,Steady
9,10,Sri Lanka,23187516,65610,353,Growing

In [106]:
df.to_sql(name="population",con=temp_db)

10

In [109]:
df.to_sql(name="population",con=temp_db,if_exists="replace")

10

In [110]:
pd.read_sql("population",con=temp_db)

,index,Rank,Country,Population,Area (km2),Density (pop/km2),Population trend[citation needed]
0,0,1,India,1389637446,3287263,423,Growing
1,1,2,Pakistan,242923845,796095,305,Rapidly growing
2,2,3,Bangladesh,165650475,148460,1116,Growing
3,3,4,Japan,124214766,377915,329,Declining[104]
4,4,5,Philippines,114597229,300000,382,Growing
5,5,6,Vietnam,103808319,331210,313,Growing
6,6,7,United Kingdom,67791400,243610,278,Growing
7,7,8,South Korea,51844834,99720,520,Steady
8,8,9,Taiwan,23580712,35980,655,Steady
9,9,10,Sri Lanka,23187516,65610,353,Growing

In [111]:
pd.read_sql_query(sql="SELECT Country FROM population",con=temp_db)

          Country
0           India
1        Pakistan
2      Bangladesh
3           Japan
4     Philippines
5         Vietnam
6  United Kingdom
7     South Korea
8          Taiwan
9       Sri Lanka